Repository: faytonn/BookIt
Catalog: BookIt.Presentation/Resources/Layout.*.resx
Languages: az

source: 100% Assurance
az: 100% Zəmanət

source: 24/7 Care
az: 24/7 Qayğı

source: About
az: Haqqında

source: Book your tickets for events
az: Tədbirlər üçün biletlərinizi alın

source: Book your tickets for movies
az: Filmlər üçün biletlərinizi alın

# Book your tickets for sports
source: Book your tickets for sport
az: İdman üçün biletlərinizi alın

source: Cinema
az: Kinoteatr

source: City
az: Şəhər

source: Contact
az: Əlaqə

source: Copyright 2025. All Rights Reserved By
az: Copyright 2025. Bütün hüquqlar qorunur

source: Date
az: Tarix

source: Events
az: Tədbirlər

source: FAQ
az: Tez-tez verilən suallar

source: Feedback
az: Rəylər

source: Home
az: Əsas Səhifə

source: Login
az: Daxil ol

source: Movies
az: Filmlər

source: News
az: Xəbərlər

source: Our Promise
az: Bizim Sözümüz

source: Privacy Policy
az: Gizlilik Siyasəti

source: Register
az: Qeydiyyatdan keç

source: Safe, secure, reliable ticketing. Your ticket to live entertainment!
az: Təhlükəsiz, etibarlı, güvənilir bilet sistemi. Canlı əyləncənizin bileti!

source: Search for Events
az: Tədbirləri axtarın

source: Search for Movies
az: Filmləri axtarın

source: Search for Sports
az: İdmanı axtarın

source: Sports
az: İdman

source: Stadium
az: Stadion

source: Subscribe
az: Abunə olun

source: Subscribe to BookIt
az: BookIt-ə abunə olun

source: Terms of Use
az: İstifadə qaydaları

source: To get exclusive benefits
az: Xüsusi üstünlüklər əldə etmək üçün

source: Trending Searches
az: Populyar axtarışlar

source: Venue
az: Məkan

source: View All
az: Hamısını göstər

source: We respect your privacy, none of your information is taken for our personal use.
az: Gizliliyinizə hörmət edirik, məlumatlarınız heç bir halda şəxsi istifadəmiz üçün istifadə edilmir.

source: Welcome to BookIt
az: BookIt-ə xoş gəldiniz

source: What are you looking for
az: Nə axtarırsınız?

source: Your Email Address
az: Email ünvanınız
